WhyNotLink/TICAR/empty.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "MSPM0G350X" --part "Default" --package "LQFP-64(PM)" --product "mspm0_sdk@2.02.00.05"
 * @v2CliArgs --device "MSPM0G3507" --package "LQFP-64(PM)" --product "mspm0_sdk@2.02.00.05"
 * @versions {"tool":"1.21.1+3772"}
 */

/**
 * Import the modules used in this configuration.
 */
const CAPTURE  = scripting.addModule("/ti/driverlib/CAPTURE", {}, false);
const CAPTURE1 = CAPTURE.addInstance();
const GPIO     = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1    = GPIO.addInstance();
const GPIO2    = GPIO.addInstance();
const GPIO3    = GPIO.addInstance();
const GPIO4    = GPIO.addInstance();
const GPIO5    = GPIO.addInstance();
const GPIO6    = GPIO.addInstance();
const GPIO7    = GPIO.addInstance();
const GPIO8    = GPIO.addInstance();
const GPIO9    = GPIO.addInstance();
const GPIO10   = GPIO.addInstance();
const GPIO11   = GPIO.addInstance();
const GPIO12   = GPIO.addInstance();
const GPIO13   = GPIO.addInstance();
const GPIO14   = GPIO.addInstance();
const GPIO15   = GPIO.addInstance();
const GPIO16   = GPIO.addInstance();
const I2C      = scripting.addModule("/ti/driverlib/I2C", {}, false);
const I2C1     = I2C.addInstance();
const PWM      = scripting.addModule("/ti/driverlib/PWM", {}, false);
const PWM1     = PWM.addInstance();
const PWM2     = PWM.addInstance();
const PWM3     = PWM.addInstance();
const SYSCTL   = scripting.addModule("/ti/driverlib/SYSCTL");
const TIMER    = scripting.addModule("/ti/driverlib/TIMER", {}, false);
const TIMER1   = TIMER.addInstance();
const UART     = scripting.addModule("/ti/driverlib/UART", {}, false);
const UART1    = UART.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
CAPTURE1.$name                              = "ULTRASONIC_TIMER";
CAPTURE1.timerClkDiv                        = 8;
CAPTURE1.timerPeriod                        = "40ms";
CAPTURE1.peripheral.$assign                 = "TIMG12";
CAPTURE1.peripheral.ccp0Pin.$assign         = "PB20";
CAPTURE1.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
CAPTURE1.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
CAPTURE1.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
CAPTURE1.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric8";

const Board = scripting.addModule("/ti/driverlib/Board", {}, false);

GPIO1.$name                          = "MOTORA_DIR";
GPIO1.associatedPins.create(2);
GPIO1.associatedPins[0].$name        = "MOTA_DIR1";
GPIO1.associatedPins[0].assignedPort = "PORTB";
GPIO1.associatedPins[0].assignedPin  = "15";
GPIO1.associatedPins[1].$name        = "MOTA_DIR2";
GPIO1.associatedPins[1].assignedPort = "PORTB";
GPIO1.associatedPins[1].assignedPin  = "16";

GPIO2.$name                          = "MOTORB_DIR";
GPIO2.associatedPins.create(2);
GPIO2.associatedPins[0].$name        = "MOTB_DIR1";
GPIO2.associatedPins[0].assignedPort = "PORTB";
GPIO2.associatedPins[0].assignedPin  = "5";
GPIO2.associatedPins[1].$name        = "MOTB_DIR2";
GPIO2.associatedPins[1].assignedPort = "PORTB";
GPIO2.associatedPins[1].assignedPin  = "4";

GPIO3.$name                          = "MOTORC_DIR";
GPIO3.associatedPins.create(2);
GPIO3.associatedPins[0].$name        = "MOTC_DIR1";
GPIO3.associatedPins[0].assignedPort = "PORTB";
GPIO3.associatedPins[0].assignedPin  = "9";
GPIO3.associatedPins[1].$name        = "MOTC_DIR2";
GPIO3.associatedPins[1].assignedPort = "PORTB";
GPIO3.associatedPins[1].assignedPin  = "7";

GPIO4.$name                          = "MOTORD_DIR";
GPIO4.associatedPins.create(2);
GPIO4.associatedPins[0].$name        = "MOTD_DIR1";
GPIO4.associatedPins[0].assignedPort = "PORTB";
GPIO4.associatedPins[0].assignedPin  = "26";
GPIO4.associatedPins[1].$name        = "MOTD_DIR2";
GPIO4.associatedPins[1].assignedPort = "PORTA";
GPIO4.associatedPins[1].assignedPin  = "13";

GPIO5.$name                          = "ENCA";
GPIO5.associatedPins.create(2);
GPIO5.associatedPins[0].$name        = "ENCA_A";
GPIO5.associatedPins[0].direction    = "INPUT";
GPIO5.associatedPins[0].assignedPort = "PORTB";
GPIO5.associatedPins[0].assignedPin  = "10";
GPIO5.associatedPins[0].interruptEn  = true;
GPIO5.associatedPins[0].polarity     = "FALL";
GPIO5.associatedPins[1].$name        = "ENCA_B";
GPIO5.associatedPins[1].direction    = "INPUT";
GPIO5.associatedPins[1].assignedPort = "PORTB";
GPIO5.associatedPins[1].assignedPin  = "11";
GPIO5.associatedPins[1].interruptEn  = true;
GPIO5.associatedPins[1].polarity     = "FALL";

GPIO6.$name                          = "ENCB";
GPIO6.associatedPins.create(2);
GPIO6.associatedPins[0].direction    = "INPUT";
GPIO6.associatedPins[0].$name        = "ENCB_A";
GPIO6.associatedPins[0].assignedPort = "PORTA";
GPIO6.associatedPins[0].assignedPin  = "29";
GPIO6.associatedPins[0].interruptEn  = true;
GPIO6.associatedPins[0].polarity     = "FALL";
GPIO6.associatedPins[1].direction    = "INPUT";
GPIO6.associatedPins[1].assignedPort = "PORTB";
GPIO6.associatedPins[1].$name        = "ENCB_b";
GPIO6.associatedPins[1].assignedPin  = "27";
GPIO6.associatedPins[1].interruptEn  = true;
GPIO6.associatedPins[1].polarity     = "FALL";

GPIO7.$name                          = "ENCC";
GPIO7.associatedPins.create(2);
GPIO7.associatedPins[0].direction    = "INPUT";
GPIO7.associatedPins[0].$name        = "ENCC_A";
GPIO7.associatedPins[0].assignedPort = "PORTA";
GPIO7.associatedPins[0].assignedPin  = "26";
GPIO7.associatedPins[0].interruptEn  = true;
GPIO7.associatedPins[0].polarity     = "FALL";
GPIO7.associatedPins[1].direction    = "INPUT";
GPIO7.associatedPins[1].$name        = "ENCC_B";
GPIO7.associatedPins[1].assignedPort = "PORTA";
GPIO7.associatedPins[1].assignedPin  = "27";
GPIO7.associatedPins[1].interruptEn  = true;
GPIO7.associatedPins[1].polarity     = "FALL";

GPIO8.$name                          = "ENCD";
GPIO8.associatedPins.create(2);
GPIO8.associatedPins[0].direction    = "INPUT";
GPIO8.associatedPins[0].assignedPort = "PORTB";
GPIO8.associatedPins[0].$name        = "ENCD_A";
GPIO8.associatedPins[0].assignedPin  = "21";
GPIO8.associatedPins[0].interruptEn  = true;
GPIO8.associatedPins[0].polarity     = "FALL";
GPIO8.associatedPins[1].direction    = "INPUT";
GPIO8.associatedPins[1].assignedPort = "PORTB";
GPIO8.associatedPins[1].$name        = "ENCD_B";
GPIO8.associatedPins[1].assignedPin  = "19";
GPIO8.associatedPins[1].interruptEn  = true;
GPIO8.associatedPins[1].polarity     = "FALL";

GPIO9.$name                          = "PTZ_DIR";
GPIO9.associatedPins.create(2);
GPIO9.associatedPins[0].$name        = "PTZ1_DIR";
GPIO9.associatedPins[0].assignedPort = "PORTA";
GPIO9.associatedPins[0].assignedPin  = "12";
GPIO9.associatedPins[1].$name        = "PTZ2_DIR";
GPIO9.associatedPins[1].assignedPort = "PORTB";
GPIO9.associatedPins[1].assignedPin  = "23";

GPIO10.$name                          = "ULTRASONIC";
GPIO10.associatedPins[0].$name        = "TRIG";
GPIO10.associatedPins[0].assignedPort = "PORTB";
GPIO10.associatedPins[0].assignedPin  = "25";

GPIO11.$name                          = "GRAY";
GPIO11.associatedPins.create(8);
GPIO11.associatedPins[0].$name        = "OUT1";
GPIO11.associatedPins[0].direction    = "INPUT";
GPIO11.associatedPins[0].assignedPort = "PORTA";
GPIO11.associatedPins[0].assignedPin  = "24";
GPIO11.associatedPins[1].$name        = "OUT2";
GPIO11.associatedPins[1].direction    = "INPUT";
GPIO11.associatedPins[1].assignedPort = "PORTA";
GPIO11.associatedPins[1].assignedPin  = "25";
GPIO11.associatedPins[2].$name        = "OUT3";
GPIO11.associatedPins[2].direction    = "INPUT";
GPIO11.associatedPins[2].assignedPort = "PORTB";
GPIO11.associatedPins[2].assignedPin  = "24";
GPIO11.associatedPins[3].$name        = "OUT4";
GPIO11.associatedPins[3].direction    = "INPUT";
GPIO11.associatedPins[3].assignedPort = "PORTA";
GPIO11.associatedPins[3].assignedPin  = "22";
GPIO11.associatedPins[4].$name        = "OUT5";
GPIO11.associatedPins[4].direction    = "INPUT";
GPIO11.associatedPins[4].assignedPort = "PORTA";
GPIO11.associatedPins[4].assignedPin  = "14";
GPIO11.associatedPins[5].$name        = "OUT6";
GPIO11.associatedPins[5].direction    = "INPUT";
GPIO11.associatedPins[5].assignedPort = "PORTA";
GPIO11.associatedPins[5].assignedPin  = "17";
GPIO11.associatedPins[6].$name        = "OUT7";
GPIO11.associatedPins[6].direction    = "INPUT";
GPIO11.associatedPins[6].assignedPort = "PORTB";
GPIO11.associatedPins[6].assignedPin  = "17";
GPIO11.associatedPins[7].$name        = "OUT8";
GPIO11.associatedPins[7].direction    = "INPUT";
GPIO11.associatedPins[7].assignedPort = "PORTB";
GPIO11.associatedPins[7].assignedPin  = "18";

GPIO12.$name                          = "KEY";
GPIO12.associatedPins.create(2);
GPIO12.associatedPins[0].$name        = "KEY1";
GPIO12.associatedPins[0].direction    = "INPUT";
GPIO12.associatedPins[0].assignedPort = "PORTA";
GPIO12.associatedPins[0].assignedPin  = "0";
GPIO12.associatedPins[0].interruptEn  = true;
GPIO12.associatedPins[0].polarity     = "FALL";
GPIO12.associatedPins[1].$name        = "KEY2";
GPIO12.associatedPins[1].direction    = "INPUT";
GPIO12.associatedPins[1].assignedPort = "PORTA";
GPIO12.associatedPins[1].assignedPin  = "1";
GPIO12.associatedPins[1].interruptEn  = true;
GPIO12.associatedPins[1].polarity     = "FALL";

GPIO13.$name                          = "LED12";
GPIO13.associatedPins.create(2);
GPIO13.associatedPins[0].$name        = "LED1_PIN";
GPIO13.associatedPins[0].assignedPort = "PORTB";
GPIO13.associatedPins[0].assignedPin  = "22";
GPIO13.associatedPins[0].initialValue = "SET";
GPIO13.associatedPins[1].$name        = "LED2_PIN";
GPIO13.associatedPins[1].assignedPort = "PORTA";
GPIO13.associatedPins[1].assignedPin  = "30";
GPIO13.associatedPins[1].initialValue = "SET";

GPIO14.$name                          = "LED34";
GPIO14.associatedPins.create(2);
GPIO14.associatedPins[0].$name        = "LED3_PIN";
GPIO14.associatedPins[0].assignedPort = "PORTB";
GPIO14.associatedPins[0].assignedPin  = "0";
GPIO14.associatedPins[0].initialValue = "SET";
GPIO14.associatedPins[1].$name        = "LED4_PIN";
GPIO14.associatedPins[1].assignedPort = "PORTB";
GPIO14.associatedPins[1].assignedPin  = "1";
GPIO14.associatedPins[1].initialValue = "SET";

GPIO15.$name                          = "BEEP_GPIO";
GPIO15.associatedPins[0].$name        = "BEEP_PIN";
GPIO15.associatedPins[0].assignedPort = "PORTA";
GPIO15.associatedPins[0].assignedPin  = "7";

