WhyNotLink/TICAR/empty.syscfg
GPIO16.$name                          = "OLED";
GPIO16.associatedPins.create(2);
GPIO16.associatedPins[0].$name        = "OLED_SDA";
GPIO16.associatedPins[0].assignedPort = "PORTA";
GPIO16.associatedPins[0].assignedPin  = "15";
GPIO16.associatedPins[1].$name        = "OLED_SCL";
GPIO16.associatedPins[1].assignedPort = "PORTA";
GPIO16.associatedPins[1].assignedPin  = "16";

I2C1.$name                     = "I2C_0";
I2C1.peripheral.sdaPin.$assign = "PA28";
I2C1.peripheral.sclPin.$assign = "PA31";
I2C1.sdaPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric5";
I2C1.sclPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric7";

PWM1.$name                              = "MOTOR_PWM";
PWM1.clockDivider                       = 8;
PWM1.ccIndex                            = [0,1,2,3];
PWM1.timerStartTimer                    = true;
PWM1.clockPrescale                      = 4;
PWM1.peripheral.ccp0Pin.$assign         = "PA8";
PWM1.peripheral.ccp1Pin.$assign         = "PA9";
PWM1.peripheral.ccp2Pin.$assign         = "PB12";
PWM1.peripheral.ccp3Pin.$assign         = "PB13";
PWM1.PWM_CHANNEL_0.$name                = "ti_driverlib_pwm_PWMTimerCC0";
PWM1.PWM_CHANNEL_1.$name                = "ti_driverlib_pwm_PWMTimerCC1";
PWM1.ccp0PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM1.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM1.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM1.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM1.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric0";
PWM1.ccp1PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM1.ccp1PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM1.ccp1PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM1.ccp1PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM1.ccp1PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric1";
PWM1.PWM_CHANNEL_2.$name                = "ti_driverlib_pwm_PWMTimerCC2";
PWM1.PWM_CHANNEL_3.$name                = "ti_driverlib_pwm_PWMTimerCC3";
PWM1.ccp2PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric2";
PWM1.ccp3PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric3";

PWM2.$name                              = "PTZ1_PWM";
PWM2.clockDivider                       = 8;
PWM2.clockPrescale                      = 100;
PWM2.ccIndex                            = [0];
PWM2.peripheral.ccp0Pin.$assign         = "PB2";
PWM2.PWM_CHANNEL_0.$name                = "ti_driverlib_pwm_PWMTimerCC4";
PWM2.PWM_CHANNEL_0.dutyCycle            = 50;
PWM2.ccp0PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM2.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM2.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM2.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM2.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric4";

PWM3.$name                              = "PTZ2_PWM";
PWM3.clockDivider                       = 8;
PWM3.clockPrescale                      = 100;
PWM3.ccIndex                            = [1];
PWM3.peripheral.$assign                 = "TIMG6";
PWM3.peripheral.ccp1Pin.$assign         = "PB3";
PWM3.ccp1PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM3.ccp1PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM3.ccp1PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM3.ccp1PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM3.ccp1PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric6";
PWM3.PWM_CHANNEL_1.$name                = "ti_driverlib_pwm_PWMTimerCC5";
PWM3.PWM_CHANNEL_1.dutyCycle            = 50;

SYSCTL.forceDefaultClkConfig = true;

TIMER1.$name              = "PID_TIMER";
TIMER1.timerClkDiv        = 8;
TIMER1.interrupts         = ["ZERO"];
TIMER1.timerClkPrescale   = 4;
TIMER1.timerPeriod        = "10ms";
TIMER1.peripheral.$assign = "TIMG7";

UART1.$name                            = "UART0";
UART1.enabledDMARXTriggers             = "DL_UART_DMA_INTERRUPT_RX";
UART1.enabledDMATXTriggers             = "DL_UART_DMA_INTERRUPT_TX";
UART1.enabledInterrupts                = ["DMA_DONE_RX","DMA_DONE_TX","RX_TIMEOUT_ERROR"];
UART1.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric9";
UART1.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART1.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART1.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART1.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART1.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric10";
UART1.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART1.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART1.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART1.DMA_CHANNEL_RX.$name             = "DMA_CH0";
UART1.DMA_CHANNEL_TX.$name             = "DMA_CH1";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
Board.peripheral.$suggestSolution                = "DEBUGSS";
Board.peripheral.swclkPin.$suggestSolution       = "PA20";
Board.peripheral.swdioPin.$suggestSolution       = "PA19";
GPIO1.associatedPins[0].pin.$suggestSolution     = "PB15";
GPIO1.associatedPins[1].pin.$suggestSolution     = "PB16";
GPIO2.associatedPins[0].pin.$suggestSolution     = "PB5";
GPIO2.associatedPins[1].pin.$suggestSolution     = "PB4";
GPIO3.associatedPins[0].pin.$suggestSolution     = "PB9";
GPIO3.associatedPins[1].pin.$suggestSolution     = "PB7";
GPIO4.associatedPins[0].pin.$suggestSolution     = "PB26";
GPIO4.associatedPins[1].pin.$suggestSolution     = "PA13";
GPIO5.associatedPins[0].pin.$suggestSolution     = "PB10";
GPIO5.associatedPins[1].pin.$suggestSolution     = "PB11";
GPIO6.associatedPins[0].pin.$suggestSolution     = "PA29";
GPIO6.associatedPins[1].pin.$suggestSolution     = "PB27";
GPIO7.associatedPins[0].pin.$suggestSolution     = "PA26";
GPIO7.associatedPins[1].pin.$suggestSolution     = "PA27";
GPIO8.associatedPins[0].pin.$suggestSolution     = "PB21";
GPIO8.associatedPins[1].pin.$suggestSolution     = "PB19";
GPIO9.associatedPins[0].pin.$suggestSolution     = "PA12";
GPIO9.associatedPins[1].pin.$suggestSolution     = "PB23";
GPIO10.associatedPins[0].pin.$suggestSolution    = "PB25";
GPIO11.associatedPins[0].pin.$suggestSolution    = "PA24";
GPIO11.associatedPins[1].pin.$suggestSolution    = "PA25";
GPIO11.associatedPins[2].pin.$suggestSolution    = "PB24";
GPIO11.associatedPins[3].pin.$suggestSolution    = "PA22";
GPIO11.associatedPins[4].pin.$suggestSolution    = "PA14";
GPIO11.associatedPins[5].pin.$suggestSolution    = "PA17";
GPIO11.associatedPins[6].pin.$suggestSolution    = "PB17";
GPIO11.associatedPins[7].pin.$suggestSolution    = "PB18";
GPIO12.associatedPins[0].pin.$suggestSolution    = "PA0";
GPIO12.associatedPins[1].pin.$suggestSolution    = "PA1";
GPIO13.associatedPins[0].pin.$suggestSolution    = "PB22";
GPIO13.associatedPins[1].pin.$suggestSolution    = "PA30";
GPIO14.associatedPins[0].pin.$suggestSolution    = "PB0";
GPIO14.associatedPins[1].pin.$suggestSolution    = "PB1";
GPIO15.associatedPins[0].pin.$suggestSolution    = "PA7";
GPIO16.associatedPins[0].pin.$suggestSolution    = "PA15";
GPIO16.associatedPins[1].pin.$suggestSolution    = "PA16";
I2C1.peripheral.$suggestSolution                 = "I2C0";
PWM1.peripheral.$suggestSolution                 = "TIMA0";
PWM2.peripheral.$suggestSolution                 = "TIMA1";
SYSCTL.peripheral.$suggestSolution               = "SYSCTL";
UART1.peripheral.$suggestSolution                = "UART0";
UART1.peripheral.rxPin.$suggestSolution          = "PA11";
UART1.peripheral.txPin.$suggestSolution          = "PA10";
UART1.DMA_CHANNEL_RX.peripheral.$suggestSolution = "DMA_CH1";
UART1.DMA_CHANNEL_TX.peripheral.$suggestSolution = "DMA_CH0";
